12/data/attachments/cbeb840ba3b7bcd6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jamie_kid_Friend_37621_4</nif:username>
            <nif:friendToBeRequested>soap_friends_d6253725-c8f0-43f9-8a64-f1a2ba3950fa</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>